Repository: nzjrs/conduit
Catalog: help/*/*.po
Languages: de

source: A group containing two folder dataproviders. The arrow has two ends, indicating that the two dataproviders will undergo a two way synchronization, that is data will flow in both directions, and both folders will contain the same information once the sync finishes.
de: Eine Gruppe, die zwei Datenquellen in Form von Ordnern enthält. Der Pfeil hat zwei Spitzen, was ein Zweiwege-Datenabgleich für diese Gruppe anzeigt. Das bedeutet, dass die Daten in zwei Richtungen fließen, wobei beide Ordner die gleichen Informationen enthalten werden, sobald der Datenabgleich beendet ist.

source: A second folder data provider. By convention, data providers that lie on the right side of groups are called data sinks. This is because during a one way sync, data can only flow into them.
de: Ein zweiter Datenquellen-Ordner. Nach Konvention sind Datenquellen auf der rechten Seite einer Gruppe Datenempfänger. Bei einem Einweg-Datenabgleich können die Daten nur in dieser Richtung fließen.

source: A Facebook and Picasa data provider for uploading images to those sites. Notice that that the group has three data providers, and the arrow has changed to indicate that data will flow in only one direction, that is images will be uploaded from F-Spot to Facebook and Picasa.
de: Ein Facebook- und Picasa-Datendienst zum Übertragen von Bildern auf deren Seiten. Beachten Sie, dass die Gruppe drei Datenquellen enthält und der Pfeil so verändert wurde, dass die Daten nur in einer Richtung fließen. Das bedeutet, dass Bilder aus F-Spot zu Facebook und Picasa übertragen werden.

source: Synchronizing Something
de: Datenabgleichsvorgänge

source: This section describes the steps required to synchronize two data providers. The example given illustrates how to synchronize two folders but the concepts are applicable to anything you wish to synchronize. If you need more information on specific settings please refer to the corresponding section of the documentation.
de: Dieser Abschnitt beschreibt die zum Datenabgleich zweier Datenquellen auszuführenden Schritte. Das gegebene Beispiel beschreibt den Datenabgleich zweier Ordner, aber die Konzepte sind auf jeden möglichen Fall anwendbar. Weitere Informationen über spezifische Einstellungen finden Sie in den entsprechenden Abschnitten der Dokumentation.

source: <xref linkend="conduit-FIG-dp-parts"/> contains two groups. This section will describe the steps to recreate those groups.
de: <xref linkend="conduit-FIG-dp-parts"/> beinhaltet zwei Gruppen. Dieser Abschnitt beschreibt die Schritte,um diese Gruppen zu erstellen.

source: The top group depicts a two way synchronization of two folders
de: Die obere Gruppe stellt einen Zweiwege-Datenabgleich zweier Ordner dar.

source: The bottom group depicts a one way sync of images, from F-Spot to Facebook, and to the Picasa web albums.
de: Die untere Gruppe stellt einen Einweg-Datenabgleich von Bildern dar, von F-Spot zu Facebook und den Picasa-Webalben.

source: Example 1: Synchronizing Two Folders
de: Beispiel 1: Abgleichen zweier Ordner

source: The following steps will recreate the two way synchronization group shown as <emphasis>#1</emphasis> in the figure above.
de: Folgende Schritte erstellen den Zweiwege-Datenabgleich, wie er in <emphasis>#1</emphasis> im Bild oben gezeigt wird.

source: On your desktop create three folders named folder1, folder2, and folder3. Drag a file of your choice into folder1.
de: Legen Sie drei Ordner mit den Name Ordner1, Ordner2 und Ordner3 auf Ihrer Arbeitsfläche an. Ziehen Sie eine Datei Ihrer Wahl in den Ordner1.

source: Start Conduit
de: Starten Sie Conduit.

source: Add a data provider for <emphasis>folder1</emphasis>
de: Fügen Sie eine Datenquelle für <emphasis>Ordner1</emphasis> hinzu.

source: From the data provider pane, drag the folder data provider and drop it on the left hand side of the canvas pane. This will be the data source that we are going to sync from.
de: Ziehen Sie aus dem Datenquellen-Teilfenster eine Ordner-Datenquelle auf die linke Seite des Ansichtsteilfensters. Das wird die Datenquelle als Ausgangspunkt des Datenabgleichs.

source: Configure <emphasis>folder1</emphasis>
de: Einstellungen für <emphasis>Ordner1</emphasis>

source: Configuring Folder 1
de: Einstellungen für Ordner 1

source: Double click on the data provider you recently dropped on the canvas. This will bring up the folder configuration window as shown below. Enter something memorable in the name field and change the <emphasis>Folder Location</emphasis> to the folder you created in step 1. <placeholder-1/>
de: Klicken Sie doppelt auf die Datenquelle, die Sie gerade in das Ansichtsteilfenster gezogen haben. Ein Konfigurationsfenster wie das unten stehende wird angezeigt. Geben Sie einen passenden Namen ein und ändern Sie das <emphasis>Ziel des Ordners</emphasis> zu dem Ordner, den Sie in Schritt 1 erstellt haben. <placeholder-1/>

source: Add a data provider for <emphasis>folder2</emphasis>
de: Fügen Sie eine Datenquelle für <emphasis>Ordner2</emphasis> hinzu

source: Drag another folder data provider from the pane on the left. This time drop it adjacent to the folder1 dataprovider. This should result in an arrow connecting it to folder1 being created.
de: Ziehen Sie eine weitere Datenquelle aus dem linken Teilfenster in das Ansichtsteilfenster, diesmal jedoch neben die Ordner1-Datenquelle. Dies sollte einen Pfeil erzeugen, der Ordner1 und Ordner2 verbindet.

source: Configure <emphasis>folder2</emphasis>
de: Einstellungen für <emphasis>Ordner2</emphasis>

source: Configure the data provider so that its <emphasis>Folder Location</emphasis> points to <emphasis>folder2</emphasis> on the desktop, and importantly, its <emphasis>Folder Name</emphasis> is the same as that entered in step <emphasis>#4</emphasis>.
de: Konfigurieren Sie die Datenquelle so, dass der <emphasis>Ort des Ordners</emphasis> auf den <emphasis>folder2</emphasis> auf der Arbeitsfläche zeigt. Wichtig ist außerdem, dass der <emphasis>Name des Ordners</emphasis> der gleiche ist, den Sie in <emphasis>Schritt 4</emphasis> angegeben haben.

source: Configure the synchronization parameters
de: Einstellen der Datenabgleichsparameter

source: Right click on the associated group, and under sync options, select a two way sync. Since this is just a basic run through on how to setup a sync we are not going to go through any advanced syncing options in this section of the documentation. If you wish more information on the options available, please see <xref linkend="conduit-providers-and-groups"/>.
de: Klicken Sie mit der rechten Maustaste auf die zugehörige Gruppe. Aus den Datenabgleichsoptionen wählen Sie den Zweiwege-Datenabgleich. Weil dies eine grundlegende Option beim Konfigurieren eines Datenabgleichs ist, werden wir zunächst in diesem Abschnitt der Dokumentation nicht auf die erweiterten Einstellungen eingehen. Wenn Sie weitere Informationen zu den Einstellungen wünschen, lesen Sie bitte unter <xref linkend="conduit-providers-and-groups"/> weiter.

source: Synchronize the two folders by right clicking on them and selecting sync, or from the File menu. Once the sync is finished you should see the file that you placed in folder1 on your desktop within folder2.
de: Der Datenabgleich kann entweder durch Rechtsklick und dann Auswahl von Datenabgleich oder über das Datei-Menü gestartet werden. Sobald der Datenabgleich beendet ist, können Sie die Datei, welche Sie im Ordner1 platziert haben, in Ordner2 sehen.

source: Example 2: Exporting Images to Multiple Destinations
de: Beispiel 2: Exportieren von Bildern zu verschiedenen Zielen

source: The second group shown in <xref linkend="conduit-FIG-dp-parts"/> shows a single F-Spot data source exporting its photos to two data sinks, a Facebook one, and a Picasa one.
de: Die zweite Gruppe, die in <xref linkend="conduit-FIG-dp-parts"/> gezeigt wird, stellt eine F-Spot-Quelle dar, die ihre Daten zu zwei Datenempfängern schickt, einem bei Facebook und einem bei Picasa.

source: Start F-Spot
de: Starten Sie F-Spot

source: Drag a F-Spot data provider from the data provider pane and drop it onto an empty spot on the canvas. A new group containing just the F-Spot data provider will be created.
de: Ziehen Sie eine Datenquelle aus dem Datenquellen-Teilfenster auf eine freie Stelle des Ansichtsteilfensters. Eine neue Gruppe wird erstellt, welche zunächst nur die Datenquelle F-Spot zeigt.

source: Drag Facebook and Picasa data providers into the Group that was just created.
de: Ziehen Sie die Datenquellen Facebook und Picasa auf die Gruppe, welche eben erstellt wurde.

source: Configure the data providers by double clicking on them.
de: Ändern Sie die Einstellungen für die Datenquellen, indem Sie darauf zweimal klicken.

source: Now synchronize the group to upload photos. You will be prompted to log into Facebook using the Conduit login window, shown in <xref linkend="conduit-FIG-login"/>.
de: Gleichen Sie jetzt die Gruppe ab, um Fotos zu übertragen. Sie werden über ein Anmeldefenster von Conduit gebeten, sich bei Facebook anzumelden, wie in Bild <xref linkend="conduit-FIG-login"/> zu sehen ist.

source: Summary
de: Zusammenfassung

source: All sync operations work exactly like this. The only difference is the data you are syncing and the providers you are using. You always follow the same sequence of steps,
de: Alle Abgleichvorgänge arbeiten genauso wie hier beschrieben. Die einzigen Unterschiede sind die abgeglichenen Daten und die verwendeten Datenquellen. Sie folgen jedoch immer diesen Arbeitsschritten:

source: Add dataproviders to create a new group, or to an existing group.
de: Fügen Sie Datenquellen zu einer neuen Gruppe oder einer bereits existierenden Gruppe hinzu.

source: Configure the data providers. Each data provider requires a unique configuration. For reference on these please the <emphasis>Data Providers</emphasis> section of the documentation.
de: Konfigurieren Sie die Datenquellen. Jede Datenquelle benötigt eine eigene Konfiguration. Dokumentation dazu finden Sie im Abschnitt <emphasis>Datenquellen</emphasis> in dieser Dokumentation.

source: Configure the group, selecting what should happen on conflict, etc.
de: Konfigurieren Sie eine Gruppe, legen Sie eine Konfliktlösung fest, usw.

source: Synchronize the dataproviders as you wish.
de: Gleichen Sie die Datenquellen auf Wunsch ab.

source: Network Synchronization
de: Netzwerk-Datenabgleich

source: If you have two computers at home, Conduit can be used to synchronize the data between them, directly, without first having to store the data somewhere else first. The steps below will illustrate how to synchronize Tomboy notes on two computers, called nzjrs-desktop and nzjrs-laptop. The following key will be used to help explain the setup procedure.
de: Wenn Sie zu Hause zwei Computer haben, können Sie Conduit zum direkten Abgleichen von Daten zwischen diesen beiden Computern verwenden, ohne dass zuvor irgendwo Daten gespeichert werden müssen. Die nachfolgenden Schritte zeigen, wie Tomboy-Notizen auf zwei Computern abgeglichen werden können, nennen wir sie nzjrs-desktop und nzjrs-laptop. Der folgende Schlüssel wird dabei helfen, die Einstellungsprozedur zu erklären.

source: <inlinegraphic format="PNG" fileref="figures/network-pc1.png"/> Image taken on the first computer.
de: <inlinegraphic format="PNG" fileref="figures/network-pc1.png"/> Auf dem ersten Computer aufgenommenes Bild.

source: <inlinegraphic format="PNG" fileref="figures/network-pc2.png"/> Image taken on the second computer.
de: <inlinegraphic format="PNG" fileref="figures/network-pc2.png"/> Auf dem zweiten Computer aufgenommenes Bild.

source: Network Synchronization Tip
de: Tipp zum Netzwerk-Datenabgleich

source: The process below, although describing Tomboy note synchronization, could be suitably modified to synchronize all sorts of data between two computers, including Contacts, Calendar information, and even F-Spot photos.
de: Obwohl der unten stehende Prozess den Abgleich von Tomboy-Notizen beschreibt, kann er leicht angepasst werden, um alle Arten von Daten zwischen Computern auszutauschen, einschließlich Kontakten, Kalendereinträgen und Fotos von F-Spot.

source: Configuration of the First Computer
de: Einstellungen für den ersten Computer

source: On the first computer create a synchronization group connecting Tomboy to the Network dataprovider, which is listed in the Miscellaneous category in the dataprovider pane. This makes Tomboy available for synchronization on the second computer. <placeholder-1/>
de: Erstellen Sie auf dem ersten Computer eine Datenabgleichsgruppe, welche Tomboy und eine Netzwerk-Datenquelle miteinander verbindet. Netzwerk-Datenquellen finden Sie in der Kategorie »Verschiedenes«. Dies ermöglicht es Tomboy, seine Daten mit einem zweiten Computer abzugleichen. <placeholder-1/>

source: After a short delay, this will result in a new category being created on the second computer. The category will take the name of the first computer, nzjrs-desktop in my case, and it shall contain any dataproviders currently available for synchronization.
de: Nach einer kurzen Verzögerung führt das zur Erstellung einer neuen Kategorie auf dem zweiten Computer. Die Kategorie übernimmt den Namen des ersten Computers, in diesem Fall »nzjrs-desktop«, und beinhaltet alle Datenquellen, die zum Datenabgleich zur Verfügung stehen.

source: Configuration of the Second Computer
de: Einstellungen für den zweiten Computer

source: Still on the second computer, drag the Tomboy dataprovider from the newly created category onto the canvas. Notice how its name is Remote Tomboy, indicating it refers to data on the remote, or first, computer. <placeholder-1/>
de: Ziehen Sie die Tomboy-Datenquelle aus der neu erstellten Kategorie in die Abgleichansicht. Beachten sie, dass der Name der Datenquelle nun »Tomboy entfernt« lautet, was auf die Daten auf dem entfernten (oder ersten) Computer verweist. <placeholder-1/>

source: Finally, on the second computer, start the sync in the normal manner.
de: Zum Schluss starten Sie auf dem zweiten Computer wie gewohnt den Datenabgleich.

source: Your tomboy notes should now be synchronized between the two computers.
de: Ihre Tomboy-Notizen sollten nun zwischen den beiden Computern abgeglichen sein.

source: File Synchronization
de: Dateiabgleich

source: Due to performance and security reasons, we do not recommend using the network sync feature to synchronize large files between two computers. We hope to address this limitation in the future.
de: Aus Sicherheits- und Geschwindigkeitsgründen ist es nicht empfehlenswert, große Dateien zwischen zwei Computern über das Netzwerk abzugleichen. Wir hoffen, dass wir diese Einschränkung in Zukunft beseitigen können.

source: translator-credits
de: Mario Blättermann <mario.blaettermann@t-online.de>, 2008 comicinker <comicinker@gmx.de>, 2008 Christian Kirbach <Christian.Kirbach@googlemail.com>
