Repository: nzjrs/conduit
Catalog: help/*/*.po
Languages: de

source: @@image: 'figures/conduit-gui-parts.png'; md5=e7c7ebe8cac03bd0768e2de105155630
de: nicht-erforderlich

source: @@image: 'figures/conduit-login.png'; md5=6e4fe96c2d518d23724e1a70a53fa026
de: translated

source: @@image: 'figures/conduit-dp.png'; md5=ce99ba0bdc70c854b1f8a9999435e250
de: nicht-erforderlich

source: @@image: 'figures/conduit-folder-configuration.png'; md5=ece672e8cf42e26947eee6e3fb5af7f9
de: translated

source: @@image: 'figures/network-sync-pc1.png'; md5=118578724965f8af01b66ccdc7e39328
de: nicht-erforderlich

source: @@image: 'figures/network-sync-pc2.png'; md5=565769e5f51b3decfebcfa18989ee391
de: nicht-erforderlich

source: Conduit Manual
de: Conduit-Handbuch

source: Conduit is a program that synchronizes things
de: Conduit ist eine Anwendung zum Abgleich von Daten

source: GNOME Documentation Project
de: GNOME-Dokumentationsprojekt

source: Conduit Manual 1.0
de: Conduit-Handbuch 1.0

source: This manual describes version 1.0 of Conduit
de: Dieses Handbuch beschreibt Version 1.0 von Conduit

source: What is Conduit
de: Was ist Conduit?

source: <ulink type="http" url="http://www.conduit-project.org">Conduit</ulink> is a synchronization application for GNOME. It allows you to synchronize your files, photos, emails, contacts, notes, calendar data and any other type of personal information and synchronize that data with another computer, an online service, or even another electronic device. Conduit manages the synchronization and conversion of data into other formats. For example, Conduit allows you to;
de: <ulink type="http" url="http://www.conduit-project.org">Conduit</ulink> ist ein Datenabgleichprogramm für GNOME. Es ermöglicht den Abgleich von Dateien, Fotos, E-Mails, Kontakten, Notizen, Kalenderdaten und vieler anderer Arten von persönlichen Informationen. Diese Daten können mit anderen Computern, Online-Datenquellen oder anderen elektronischen Geräten abgeglichen werden. Conduit verwaltet den Abgleich und die Umwandlung in andere Formate. Conduit ermöglicht beispielsweise:

source: Synchronize your <ulink type="http" url="http://www.gnome.org/projects/tomboy/">Tomboy notes</ulink> with another computer
de: Datenabgleich von <ulink type="http" url="http://www.gnome.org/projects/tomboy/">Tomboy-Notizen</ulink> mit einem anderen Computer

source: Synchronize your PIM data to your mobile phone, <ulink type="http" url="http://en.wikipedia.org/wiki/IPod">iPod</ulink>, <ulink type="http" url="http://en.wikipedia.org/wiki/Nokia_N800">Nokia Internet tablet</ulink>, or between computers
de: Datenabgleich von PIM-Daten mit einem Mobiltelefon, einem <ulink type="http" url="http://en.wikipedia.org/wiki/IPod">iPod</ulink>, <ulink type="http" url="http://en.wikipedia.org/wiki/Nokia_N800">Nokia Internet Tablet</ulink>, oder zwischen Computern

source: Upload photos to <ulink type="http" url="http://www.flickr.com">Flickr</ulink>, <ulink type="http" url="http://picasaweb.google.com">Picasa</ulink>, <ulink type="http" url="http://www.smugmug.com">Smugmug</ulink>, <ulink type="http" url="http://shutterfly.com">Shutterfly</ulink> and your iPod,
de: Fotos auf einen <ulink type="http" url="http://www.flickr.com">Flickr</ulink>, <ulink type="http" url="http://picasaweb.google.com">Picasa</ulink>, <ulink type="http" url="http://www.smugmug.com">Smugmug</ulink>, <ulink type="http" url="http://shutterfly.com">Shutterfly</ulink>-Server oder einen iPod zu laden

source: ... and many more
de: … und vieles, vieles mehr.

source: Any combination you can imagine, Conduit will take care of the conversion and synchronization.
de: In jeder nur denkbaren Kombination wird Conduit auf korrekte Datenumwandlung und korrekten Datenabgleich achten.

source: Use Cases
de: Anwendungsbereiche

source: Fred wants to sync his tomboy notes with <ulink type="http" url="http://www.google.com/notebook">Google notebook</ulink>
de: Fred möchte seine Tomboy-Notizen mit dem <ulink type="http" url="http://www.google.com/notebook">Google-Notizbuch</ulink> abgleichen

source: Joey wants to sync whatever is on his desktop to his <ulink type="http" url="http://www.backpackit.com">backpack account</ulink>
de: Jochen möchte, egal was auch immer auf seiner Arbeitsfläche ist, mit seinem <ulink type="http" url="http://www.backpackit.com">Backpack-Konto</ulink> abgleichen

source: Nellie wants to keep a directory on his laptop and his desktop in sync
de: Melanie möchte einen Ordner auf Ihrem Arbeitsplatz-Rechner und Ihrem Laptop auf dem gleichen Stand halten

source: Paul wants to keep his evolution contacts in sync with his mobile phone
de: Paul möchte seine Evolution-Kontakte mit den Kontakten in seinem Mobiltelefon abgleichen

source: Steve wants to keep his gnome preferences in sync between his two computers
de: Stefan möchte seine GNOME-Einstellungen auf seinen zwei Computern immer auf dem gleichen Stand halten

source: John wants to keep a directory of <ulink type="http" url="http://openoffice.org">OpenOffice</ulink> documents in sync with copies held on <ulink type="http" url="http://docs.google.com">Google Docs</ulink>
de: Johannes möchte einen Ordner, der <ulink type="http" url="http://openoffice.org">OpenOffice</ulink>-Dokumente enthält, mit Kopien in <ulink type="http" url="http://docs.google.com">Google Docs</ulink> abgleichen

source: Pete wants to have photos saved to his server to be pushed to an external back up (usb hard drive / off-site ftp)
de: Peter möchte auf seinem Server abgelegte Fotos auf einem externen Sicherungsmedium speichern (USB-Festplatte / FTP-Server)

source: Introduction
de: Einführung

source: Conduit's goals are to synchronize your data as seamlessly as possible, be it from remote device or remote websites. It is about extending your life as you see it needs to be, no longer constrained by data, devices or formats. Conduit enables you to take your data where you want when you want. All of your mobile devices could be synchronized automatically by Conduit. Home file back-ups to a remote server? Synced automatically.
de: Das Ziel von Conduit ist es, den Abgleich der Daten so nahtlos wie möglich zu gestalten, sei es von einem anderen Gerät oder einer entfernten Website.

source: It may sometimes seem that Conduit is overly complicated, one of the design goals has always been to make the interface as simple and intuitive as possible. However Conduit is much more powerful then the simplistic design may lead on. This documentation will describe all the configuration options for groups and data providers, while the following gives some examples of items you may wish to synchronize;
de: Es mag manchmal den Anschein haben, dass Conduit überaus kompliziert ist. Jedoch war eines der Ziele beim Oberflächendesign, die Anwendung so simpel und intuitiv wie möglich zu gestalten. Allerdings ist Conduit viel mächtiger, als es das simple Design vermuten lässt. Diese Dokumentation beschreibt alle Einstellungsoptionen für Gruppen und Datenquellen. Im Folgenden werden einige Beispiele für Dinge gezeigt, die abgeglichen werden können:

source: A <ulink type="http" url="http://www.gnome.org">GNOME</ulink> user might store information in a wide variety of places on the desktop including;
de: Ein <ulink type="http" url="http://www.gnome.org">GNOME</ulink>-Nutzer möchte Informationen an vielen Orten auf der Arbeitsfläche speichern, einschließlich:

source: <ulink type="http" url="http://www.gnome.org/projects/evolution/">Evolution</ulink> (email, calendar, address book)
de: <ulink type="http" url="http://www.gnome.org/projects/evolution/">Evolution</ulink> (E-Mail, Kalender, Adressbuch)

source: <ulink type="http" url="http://www.gnome.org/projects/tomboy/">Tomboy</ulink> (notes)
de: <ulink type="http" url="http://www.gnome.org/projects/tomboy/">Tomboy</ulink> (Notizen)

source: Directories (important files)
de: Ordner (wichtige Dateien)

source: Photos
de: Fotos

source: Bookmarks (web and feeds)
de: Lesezeichen (Webseiten und Nachrichtenquellen)

source: Music
de: Musik

source: <ulink type="http" url="http://del.icio.us">Delicious</ulink> (bookmarks)
de: <ulink type="http" url="http://del.icio.us">Delicious</ulink> (Lesezeichen)

source: <ulink type="http" url="http://www.gmail.com">Gmail</ulink> (bookmarks, calendar, feeds, email, photos)
de: <ulink type="http" url="http://www.gmail.com">Gmail</ulink> (Lesezeichen, Kalender, Nachrichtenquellen, E-Mail, Fotos)

source: <ulink type="http" url="http://www.flickr.com">Flickr</ulink> (photos)
de: <ulink type="http" url="http://www.flickr.com">Flickr</ulink> (Fotos)

source: The user might also use one of the many popular online services including <placeholder-1/>
de: Der Benutzer könnte einen der vielen populären Online-Dienste nutzen wollen, wie beispielsweise <placeholder-1/>

source: A second laptop, also running GNOME
de: Ein zweiter Laptop, auf dem ebenfalls GNOME läuft

source: A mobile phone
de: Ein Mobiltelefon

source: A <ulink type="http" url="http://www.nokia.com">Nokia</ulink> 770/800
de: Ein <ulink type="http" url="http://www.nokia.com">Nokia</ulink> 770/800

source: A <ulink type="http" url="http://www.palm.com">Palm</ulink> or <ulink type="http" url="http://www.microsoft.com/windowsmobile/default.mspx">Windows Mobile</ulink> Pocket PC
de: Ein Pocket-PC mit <ulink type="http" url="http://www.palm.com">PalmOS</ulink> oder <ulink type="http" url="http://www.microsoft.com/windowsmobile/default.mspx">Windows Mobile</ulink>

source: An iPod
de: Ein iPod

source: They probably also own another electronic device such as <placeholder-1/>
de: Vielleicht verfügen Sie über weitere elektronische Geräte wie <placeholder-1/>

source: Its hard enough keeping your information organized when limited to the desktop, let alone the added burden of keeping your information in sync with any of the other services or devices listed above.
de: Es ist ohnehin schwer genug, Informationen bloß auf der Arbeitsfläche zu organisieren, und dann auch noch synchron auf den oben aufgelisteten Diensten oder Geräten zu halten.

source: Our goal for Conduit is to allow GNOME users to keep their information in sync. Irrespective of the type, irrespective of the way in which that information is stored. Conduit should just work.
de: Unser Ziel für Conduit ist es, den GNOME-Benutzern zu ermöglichen, Informationen auf dem gleichen Stand zu halten, ohne Rücksicht darauf, um welche Art von Information es sich handelt. Conduit soll einfach funktionieren.

source: Understanding the Conduit Interface
de: Die Conduit-Benutzeroberfläche

source: Conduit has a few basic concepts worth understanding before you begin. Knowing these concepts will help you discover things that you never knew you could keep in sync, for example, uploading photos right from your mobile phone to Picasa!
de: Conduit basiert auf einigen grundlegenden Konzepten, die man vor Beginn verstehen sollte. Das Wissen über diese Konzepte wird Sie Dinge entdecken lassen, von denen Sie nie gedacht hätten, dass ein Datenabgleich möglich ist. Beispielsweise das Hochladen von Fotos direkt von Ihrem Mobiltelefon zum Bilderdienst Picasa!

source: Conduit GUI
de: Conduit-Benutzeroberfläche

source: The Parts of the Conduit GUI
de: Die Bestandteile der Conduit-Benutzeroberfläche

source: <xref linkend="conduit-FIG-gui-parts"/> shows the Conduit interface's four main components;
de: <xref linkend="conduit-FIG-gui-parts"/> zeigt die vier Hauptkomponenten der Conduit-Benutzeroberfläche:

source: The file, edit and help menus store operations which apply to all groups. For more information on the contents of these menus, see below.
de: Die Menüs Datei, Bearbeiten und Hilfe bieten Aktionen, die auf alle Gruppen angewendet werden. Für weitere Informationen über den Inhalt dieser Menüs, siehe unten.

source: The Menu<placeholder-1/>
de: Das Menü<placeholder-1/>

source: Located on the left hand side of the window, lists all of the data providers that are detected and ready for use on your system.
de: Listet an der linken Seite des Fensters alle Datenquellen auf, die auf Ihrem System gefunden wurden und verwendet werden können.

source: Data providers are the source or destination of data you wish to sync. Please refer to the <emphasis>Data Provider</emphasis> section of the documentation to receive instructions on how to configure each data provider.
de: Datenquellen sind die Quelle oder das Ziel der Daten, die abgeglichen werden sollen. Für Anweisungen über die Konfiguration jeder dieser Datenquellen ziehen Sie bitte den Abschnitt <emphasis>Datenquellen</emphasis> zu Rate.

source: The Data Provider Pane <placeholder-1/>
de: Die Datenquellen-Teilfenster <placeholder-1/>

source: Used to create groups of data providers to synchronize. Drag a data source to the left of the canvas pane and one or more data sinks to the right of the data pane to create a group. For more explanation on groups please check <xref linkend="conduit-providers-and-groups"/>.
de: Wird verwendet, um Gruppen von Datenquellen zum Abgleichen anzulegen. Ziehen Sie eine Datenquelle in die linke Hälfte des Ansichtsfensters und einen oder mehrere Datenempfänger in die rechte Hälfte, um eine Gruppe anzulegen. Nähere Erläuterungen über Gruppen finden Sie in <xref linkend="conduit-providers-and-groups"/>.

source: The Canvas Pane <placeholder-1/>
de: Das Ansichtsteilfenster <placeholder-1/>

source: If you receive any conflict notifications while trying to run a sync job they will be listed here. For information on how to deal with possible conflicts please check the <emphasis>Conflicts and Resolutions</emphasis> section of the documentation.
de: Eventuelle Fehlermeldungen während eines Datenabgleichs werden hier angezeigt. Weitere Informationen über den Umgang mit möglichen Fehlermeldungen finden Sie im Abschnitt <emphasis>Konflikte und Lösungen</emphasis> in dieser Dokumentation.

source: The Conflicts Pane <placeholder-1/>
de: Das Konflikte-Teilfenster <placeholder-1/>

source: The Menus
de: Die Menüs

source: The File Menu
de: Das Datei-Menü

source: <menuchoice><guimenu>File</guimenu><guimenuitem>Save</guimenuitem></menuchoice> Saves all configured synchronization groups. Groups are saved automatically when you exit Conduit if you have selected <guilabel>Save Settings on Exit</guilabel> in <xref linkend="conduit-preferences-window"/>
de: <menuchoice><guimenu>Datei</guimenu><guimenuitem>Speichern</guimenuitem></menuchoice> Conduit speichert beim Beenden der Anwendung alle angelegten Gruppen. Wenn Sie diese Option nicht markiert haben, werden alle Datenquellen, Gruppen und deren beider Einstellungen gespeichert, wenn Sie <guilabel>Automatisch beim Beenden speichern</guilabel> im <xref linkend="conduit-preferences-window"/> gewählt haben.

source: <menuchoice><guimenu>File</guimenu><guimenuitem>Synchronize All</guimenuitem></menuchoice> Synchronizes all groups at the same time. You can still run each sync group separately (see the <emphasis>Groups</emphasis> section), but this saves you the time of having to select and manually going through each group to start the sync process.
de: <menuchoice><guimenu>Datei</guimenu><guimenuitem>Alles abgleichen</guimenuitem></menuchoice> Gleicht alle Gruppen gleichzeitig ab. Sie können auch jede Gruppe separat abgleichen (siehe im Abschnitt <emphasis>Gruppen</emphasis>), aber diese Option erspart es Ihnen, alle Gruppen einzeln auszuwählen, um den Abgleichvorgang zu starten.

source: <menuchoice><guimenu>File</guimenu><guimenuitem>Quit</guimenuitem></menuchoice> Closes conduit. You will be prompted to stop any synchronization currently in progress.
de: <menuchoice><guimenu>Datei</guimenu><guimenuitem>Beenden</guimenuitem></menuchoice> Beendet Conduit. Bei eventuell noch laufenden Datenabgleichvorgängen wird um eine Bestätigung gebeten.

source: The Edit Menu
de: Das Bearbeiten-Menü

source: <menuchoice><guimenu>Edit</guimenu><guimenuitem>Clear Canvas</guimenuitem></menuchoice> Removes all configurations, data providers, and groups from the canvas pane. This allows you start using the canvas as it was a clean slate. The best time to use this is when you are re-configuring a large portion of your sync groups. There is no quick way to revert back after selecting this setting.
de: <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Ansichtsteilfenster löschen</guimenuitem></menuchoice>. Entfernt alle Konfigurationen, Datenquellen und Gruppen aus dem Ansichtsteilfenster. Das erlaubt Ihnen, das Ansichtsfenster als leeres Blatt zu starten. Nützlich ist dies, wenn Sie den größten Teil der Gruppen neu konfigurieren wollen. Allerdings gibt es keinen einfachen Weg, nach dem Löschen Ihre alte Konfiguration zurück zu holen.

source: <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> Global Conduit settings that effect all of your sync groups and basic Conduit operations. For more information please see <xref linkend="conduit-preferences-window"/>
de: <menuchoice><guimenu>Bearbeiten</guimenu><guimenuitem>Einstellungen</guimenuitem></menuchoice> Globale Conduit-Einstellungen, die sich auf alle Datenabgleichsgruppen und auf grundlegende Conduit-Aktionen auswirken. Weitere Informationen finden Sie in <xref linkend="conduit-preferences-window"/>.

source: The Help Menu
de: Das Hilfe-Menü

source: <menuchoice><guimenu>Help</guimenu><guimenuitem>Developers</guimenuitem></menuchoice> If you are developer, and interested in contributing to Conduit, then this option includes links to all the appropriate documentation.
de: <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Entwickler</guimenuitem></menuchoice> Wenn Sie als Entwickler an Conduit mitarbeiten wollen, finden Sie hier alle Links zu geeigneter Dokumentation.

source: <menuchoice><guimenu>Help</guimenu><guimenuitem>Contents</guimenuitem></menuchoice> Shows this help document.
de: <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Inhalte</guimenuitem></menuchoice> Zeigt dieses Hilfedokument an.

source: <menuchoice><guimenu>Help</guimenu><guimenuitem>About</guimenuitem></menuchoice> Shows the version number and a list of Conduit developers.
de: <menuchoice><guimenu>Hilfe</guimenu><guimenuitem>Info</guimenuitem></menuchoice> Zeigt die Versionsnummer und die Namen der Entwickler an.

source: The Preferences Window
de: Das Einstellungsfenster

source: The Conduit preferences is accessed from the Edit menu. Any setting or change that you make within the preferences menu affect all of your sync groups and basic Conduit operations.
de: Die Conduit-Einstellungen erreichen Sie über das Bearbeiten-Menü. Jede im Einstellungsdialog vorgenommene Änderung wird auf alle Datenabgleichsgruppen und Conduit-Aktionen angewendet.

source: Configuration Tab
de: Reiter »Einstellungen«

source: The configuration tab is where all of Conduit's global settings are configured. There are six global settings:
de: In diesem Reiter werden die globalen Conduit-Einstellungen angepasst. Es gibt sechs globale Einstellungen:

source: Save Settings on Exit
de: Einstellungen beim Beenden speichern

source: Instructs Conduit that all configured dataproviders and groups should be saved when the application exits.
de: Weist Conduit an, beim Beenden der Anwendung alle konfigurierten Datenquellen und Gruppen zu speichern.

source: Show Status Icon
de: Zeige Benachrichtigungssymbol

source: Shows a status icon in the notification area. This icon animates to indicate a sync is in progress.
de: Zeigt das Benachrichtigungssymbol im Benachrichtigungsfeld. Dieses Symbol wird animiert, während ein Datenabgleich stattfindet.

source: Minimize to Notification Area
de: Ins Benachrichtigungsfeld minimieren

source: Instructs Conduit to minimize to the notification area instead of to the panel.
de: Weist Conduit an, das Anwendungsfenster ins Benachrichtigungsfeld zu minimieren anstatt ins Panel.

source: Use Built in Web Browser
de: Eingebauten Webbrowser verwenden

source: When a data provider requires that you log onto a website, this option tells Conduit to use its own web browser to do so.
de: Für den Fall, dass eine Datenquelle eine Anmeldung erfordert, öffnet Conduit den eingebauten Webbrowser, falls diese Option aktiviert ist.

source: When an Item Has Been Deleted
de: Wenn ein Eintrag entfernt wurde

source: Where There is a Two Way Conflict
de: Bei einem Zweiwege-Konflikt

source: Data Providers Tab
de: Reiter »Datenquellen«

source: This tab shows a list of the data providers that are currently installed.
de: Dieser Reiter zeigt eine Liste der gegenwärtig installierten Datenquellen

source: Data Conversions Tab
de: Reiter »Datenumwandler«

source: This tab lists the data conversions that Conduit is capable of performing.
de: Dieser Reiter listet die Datenumwandlungen auf, zu denen Conduit in der Lage ist.

source: Mapping DB
de: Datenbank-Zuordnung

source: This is a list of the UID that Conduit uses to maintain accurate sync data from different sources. Here you have the option to clear the mapping database.
de: Dies ist eine Liste von UIDs, die Conduit verwendet, um den Datenabgleich der Daten aus verschiedenen Quellen korrekt zu handhaben. Hier haben Sie die Möglichkeit, die Datenbank-Zuordnung zu löschen.

source: The Web Login Window
de: Das Web-Anmeldefenster

source: Sometimes you will be required to log into a website associated with certain data providers. The frequency at which you may have to log in is not determined by Conduit, but by the security policy of the respective data provider. For example, Box.net requires you to log in every time Conduit is run, whereas Flickr only requires you to log in once, to give permission to Conduit to upload photos. If you are required to log into a website, and you have selected the <guilabel>Use Built in Web Browser</guilabel> from the Conduit preferences, then a window will pop up like the one shown below.
de: Verschiedene Datendienste erfordern eine Anmeldung auf deren Webseite. Die Zeitabstände, in denen Sie sich jeweils neu anmelden müssen, werden nicht durch Conduit bestimmt, sondern durch die Sicherheitsbestimmungen des jeweiligen Anbieters. Beispielsweise erbittet Box.net jedes mal beim Start von Conduit eine neue Anmeldung, andererseits ist für den Bilderdienst Flickr nur eine einzige Anmeldung nötig, um Fotos übertragen zu können. Wenn auf einer Webseite eine Anmeldung nötig ist und die Option <guilabel>Eingebauten Webbrowser benutzen</guilabel> in den Conduit-Einstellungen aktiviert wurde, wird ein Fenster wie das nachfolgende geöffnet.

source: Conduit Login Window
de: Conduit-Anmeldefenster

source: The window shown when logging into data provider websites
de: Beim Anmelden auf einer Datenquellen-Website angezeigtes Fenster

source: Data Providers and Groups
de: Datenquellen und Gruppen

source: Conduit represents the things your want to synchronize graphically. When data providers get added to the canvas, they get arranged into so called groups. A group is a collection of data providers that share data. In the figure below you will see the following parts
de: Conduit stellt den Datenabgleich grafisch dar. Sobald Datenquellen zum Ansichtsfenster hinzugefügt werden, werden sie in so genannten Gruppen angeordnet. Eine Gruppe ist eine Ansammlung von Anbietern, welche Daten austauschen. Im unten stehenden Bild sehen Sie folgende Teile:

source: Conduit Depicts Synchronizations Graphically
de: Conduit stellt Datenabgleiche grafisch dar

source: Parts of a Synchronization Group
de: Teile einer Datenabgleichsgruppe

source: A data provider for synchronizing two way whose status indicates that it is ready to be synchronized.
de: Eine Datenquelle zum Abgleichen in zwei Richtungen, dessen Status anzeigt, dass er bereit zum Datenabgleich ist.
